lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
  //reset list of scanned devices

  memset(&scannedDevicesPackage, 0 , sizeof(scannedDevicesPackage));


  //reset flash
  struct settings settingsToWrite;
  memset(&settingsToWrite, 0 , sizeof(settingsToWrite));

  //initilase sensor hardcode
  strcpy(settingsToWrite.sensors[0].name,"	Tacx Vortex 18043");
  memcpy(settingsToWrite.sensors[0].macAddress, macTackx, sizeof(settingsToWrite.sensors[0].macAddress));

//  strcpy(settingsToWrite.sensors[0].name,"	Ridesense");
//  memcpy(settingsToWrite.sensors[0].macAddress, macRidesense, sizeof(settingsToWrite.sensors[0].macAddress));
//
//  strcpy(settingsToWrite.sensors[1].name,"	EWWU111");
//  memcpy(settingsToWrite.sensors[1].macAddress, macShimano, sizeof(settingsToWrite.sensors[1].macAddress));


  saveToFlash((uint8_t*) &settingsToWrite, sizeof(settingsToWrite));


/* USER CODE END APP_BLE_Init_2 */
  return;
}

void Trigger_Scan_Request( void ){
	UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_1);
}

void Trigger_Connection_Request( int indexInFlash,int indexInScannedDevices,Pairing_request_status status){
	switch(indexInFlash){
		case 0:
			if(status == CONNECTING){
				BleApplicationContext.EndDevice1Found = 0x01;
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
			}
			else{
				BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = BleApplicationContext.EndDevice_Connection_Status[0];
				BleApplicationContext.EndDevice1Found = 0x00;
			}

			break;
		case 1:
			if(status == CONNECTING){
				BleApplicationContext.EndDevice2Found = 0x01;
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
			}
			else{
				BleApplicationContext.EndDevice_Connection_Status[1] = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = BleApplicationContext.EndDevice_Connection_Status[1];
				BleApplicationContext.EndDevice2Found = 0x00;
			}

			break;
		case 2:
			if(status == CONNECTING){
				BleApplicationContext.EndDevice3Found = 0x01;
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
			}
			else{
				BleApplicationContext.EndDevice_Connection_Status[2] = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = BleApplicationContext.EndDevice_Connection_Status[2];
				BleApplicationContext.EndDevice3Found = 0x00;
			}

			break;
		case 3:
			if(status == CONNECTING){
				BleApplicationContext.EndDevice4Found = 0x01;
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_4_ID, CFG_SCH_PRIO_0);
			}
			else{
				BleApplicationContext.EndDevice_Connection_Status[3] = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = BleApplicationContext.EndDevice_Connection_Status[3];
				BleApplicationContext.EndDevice4Found = 0x00;
			}

			break;
		default:
			break;
	}
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blue_aci *blue_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  uint8_t result;
  uint8_t role, event_type, event_data_size;
  int k = 0;
  uint8_t *adv_report_data;
  uint8_t adtype, adlength;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;

	struct settings readSettings;
	readFlash((uint8_t*)&readSettings);

	//printf("event_pckt: %x\n\r",event_pckt->evt);
  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */

    /* USER CODE END evt */
    case EVT_VENDOR:
    {
      handleNotification.P2P_Evt_Opcode = P2P_SERVER1_DISCON_HANDLE_EVT;
      blue_evt = (evt_blue_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */
      //printf("ecode: %x\n\r",blue_evt->ecode);
      /* USER CODE END EVT_VENDOR */

      switch (blue_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */
        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        {
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blue_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
              && gap_evt_proc_complete->Status == 0x00)
          {
            /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */
            BSP_LED_Off(LED_BLUE);

            //struct settings readSettings;
            //readFlash((uint8_t*)&readSettings);

            for(int i = 0; i < sizeof(readSettings.sensors); i++){
            	for(int k = 0; k < scannedDevicesPackage.numberOfScannedDevices; k++){
            		if(strcmp(scannedDevicesPackage.scannedDevicesList[k].deviceName, readSettings.sensors[i].name) == 0 && readSettings.sensors[i].name[0] != 0){
            			switch(i){
							case 0:
								BleApplicationContext.EndDevice1Found = 0x01;
								break;
							case 1:
								BleApplicationContext.EndDevice2Found = 0x01;
								break;
							case 2:
								BleApplicationContext.EndDevice3Found = 0x01;
								break;
							case 3:
								BleApplicationContext.EndDevice4Found = 0x01;
								break;
							default:
								break;
            			}
            		}
            	}
            }


            /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */

            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n");
            /*if a device found, connect to it, device 1 being chosen first if both found*/
            if (BleApplicationContext.EndDevice1Found == 0x01
                && BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
            }
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
            else if (BleApplicationContext.EndDevice2Found == 0x01
                && BleApplicationContext.EndDevice_Connection_Status[1] != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
            }
            else if (BleApplicationContext.EndDevice3Found == 0x01
                && BleApplicationContext.EndDevice_Connection_Status[2] != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
            }
            else if (BleApplicationContext.EndDevice4Found == 0x01
                && BleApplicationContext.EndDevice_Connection_Status[3] != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_4_ID, CFG_SCH_PRIO_0);
            }
          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
#endif

